<?php

// Циклы для данных в массивах

// 1. Создайте массив boringToys скучных игрушек и случайного количества элементов от 1 до 10, где каждый элемент этого массива это ассоциативный массив с двумя полями:
// - Название игрушки: в виде "Игрушка 1"
// - Цена игрушки: случайное число от 100 до 1000


// 2. Создайте массив cars из трех машин: Мерседес - 10000 руб, BMW - 9999 руб, Автобус - 20000 руб.
// Объем данных о машинах будет увеличиваться, поэтому создайте ассоциативный массив с данными о машинах


// 3. Посчитайте стоимость и выведите общую стоимость всех машин, и выведите ее


// 4. Для каждой машины добавьте поле colors - возможные варианты цветов при этом для каждого цвета, есть своя надбавка к стоимости (разная для разных машин)
// Создайте массив colors с цветами для каждой машины и добавьте по три случайных цвета каждой машине для каждого цвета укажите надбавку - случайное число от 0 до 100
// Выведите этот массив и убедитесь в его правильности.


// 5. Каталог автомобилей.
// А теперь выведите весь каталог автомобилей в виде: "Автомобиль {} цвета {} всего за: {} руб", вместо {} поставьте соответственно: название автомобиля, цвет, стоимость в этом цвете
